import numpy as np

# Задано лінійне диференціальне рівняння другого порядку
#  
# y''(x) + p(x)y'(x) + q(x)y(x) = f(x),  x є [a, b]
#  
# та крайові умови:
#  
# alpha_0 y(a) + alpha_1 y'(a) = A 
# beta_0 y(b) + beta_1 y'(b) = B
#  
# Функції p(x), q(x), f(x) є відомими та неперервними на [a, b].
# Числові коефіцієнти alpha_0, alpha_1, A та beta_0, beta_1, B також відомі, причому для коефіцієнтів
# alpha_0, alpha_1, beta_0, beta_1 виконуються умови:
#  
# | alpha_0 | + | alpha_1 | =/= 0;
# | beta_0 | + | beta_1 | =/= 0;
#  
# Знайти функцію y(x) на відрізку [a, b]

if __name__ == "__main__":
    
    print("Hi")